---
kind: other
id: Methods.T:Autodesk.Revit.DB.FamilyThermalProperties
source: html/94813953-4893-214e-bfc9-37e07edb7acd.htm
---
# FamilyThermalProperties Methods

Finds the thermal properties by the 'id' property of a constructionType node in Constructions.xml.